trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПравилоНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8158662b-6a9a-4862-8b90-82fc42b89722">
    <name>Причина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1337e572-00d6-47b1-8f0b-eb21595b97f2">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fe50f5-ddbd-455c-9099-0f0bff057d44">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="959ca8c5-0d9a-4cc5-ab96-2fe00bd0ada9">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0d224d2c-ba57-4298-be05-ab8f3a7838ed">
    <name>ВидПравила</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a9e9e1c-9b67-434d-b6d2-112391d11cf1">
    <name>КомментарийВКарточкиПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db7d6939-2cd5-4ee3-966e-75f50f11577f">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ff99f87-48f6-4cc0-8cc6-e248bfd00b83">
    <name>Утверждающий1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7c188b1-fc86-45b4-a790-80c762a23fa5">
    <name>Утверждающий2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01d5fa18-87ef-47ab-8eeb-3f63e64ac0e9">
    <name>ИДЭлементаВБитриксе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="77ab5aa4-e2f0-4204-a0d2-19561758ca39">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисление</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислитьЗаСчет</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/СобытияОбъектовАльтерра/СобытияОбъектовАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e70f20ec-7ffe-4467-9958-8ee45b3ba97e">
  <name>СобытияОбъектовАльтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions extendedConfigurationObject="9d6673f6-d579-46b5-8c82-6134e22aff40">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bf1bcf04-f54e-4486-b6f2-435be7f36471">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/НачислениеИСписаниеБонусныхБаллов/ManagerModule.bsl
Процедура ОтправкаСМСОНачисленныхБонусах(ДокСсылка, ИДБизнесПроцесса) Экспорт  
	// Проверить причину «По жалобе» ,«Доначисление» и «Неверный ценник»
	Если ДокСсылка.ВидПравила = Перечисления.ВидыПравилНачисленияБонусныхБаллов.Начисление И ПодходящаяПричинаНачисления(ДокСсылка) Тогда	 
		Партнер = ДокСсылка.Начисление[0].Партнер;
		НомерТелефона = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Партнер, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
		Если ЗначениеЗаполнено(НомерТелефона) Тогда
			АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона,,,,,"+7");
			НомераТелефонов = Новый Массив;
			НомераТелефонов.Добавить(НомерТелефона);
			Текст = "Бонусы по обращению ID"+ ИДБизнесПроцесса+ " начислены. Стройтесь с нами";
			Попытка 
				РезультатОтправки = ОтправкаSMS.ОтправитьSMS(НомераТелефонов, Текст);
			Исключение
				ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". "+ РезультатОтправки.ОписаниеОшибки;
				ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);	 		
			КонецПопытки;			
			Если Не ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда                     
				// Зарегистрировать в регистре СобытияОбъектовАльтерра    
				Запись = РегистрыСведений.СобытияОбъектовАльтерра.СоздатьМенеджерЗаписи();
				Запись.Период = ТекущаяДата();
				Запись.Объект = ДокСсылка; 
				Запись.Событие = Справочники.СобытияОбъектовАльтерра.ОтправленаСМСклиентуОГотовности; 
				Запись.Записать();
			Иначе
				ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". "+ РезультатОтправки.ОписаниеОшибки;
				ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);
			КонецЕсли
		Иначе	
			ОписаниеОшибки = "Не удалось отправить СМС партнеру "+ Партнер + ". Номер телефона партнера не указан в карточке";
			ЗаписьЖурналаРегистрации("Отправка СМС о начисленных бонусах", УровеньЖурналаРегистрации.Ошибка, , ДокСсылка, ОписаниеОшибки);
		КонецЕсли	
	КонецЕсли	
КонецПроцедуры	

Функция ПодходящаяПричинаНачисления(ДокСсылка);
    МассивПричин = Новый Массив;     
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000007");// Доначисление (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000006");// По жалобе (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Причина = Справочники.ПричиныНачисленияБонусныхБаллов.НайтиПоКоду("000000012");// Неверный ценник (по бп)
	Если Причина <> Справочники.ПричиныНачисленияБонусныхБаллов.ПустаяСсылка() Тогда  
		МассивПричин.Добавить(Причина);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеИСписаниеБонусныхБаллов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачислениеИСписаниеБонусныхБаллов КАК НачислениеИСписаниеБонусныхБаллов
		|ГДЕ
		|	НачислениеИСписаниеБонусныхБаллов.Проведен
		|	И НачислениеИСписаниеБонусныхБаллов.Причина В(&МассивПричин)
		|	И НачислениеИСписаниеБонусныхБаллов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("МассивПричин", МассивПричин);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина
	КонецЕсли;
	Возврат Ложь
КонецФункции
